#ifndef _TCPSOCKET_H
#define _TCPSOCKET_H

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/types.h>
#include <sys/socket.h>
#include <unistd.h>
#include <netinet/in.h>
#include <arpa/inet.h>

/******************************************************************************
 * 函数：createSocket
 * 参数：无
 * 功能：创建一个socket
 * 返回值：-1--失败；其他--socket的fd
 *****************************************************************************/
int createSocket();

/******************************************************************************
 * 函数：setListen
 * 参数：listenFd--监听fd；listenPort--监听端口
 * 功能：将listenFd和监听的ip，端口等进行绑定，并开启监听
 * 返回值：-1--失败；0--成功
 *****************************************************************************/
int setListen(int listenFd, unsigned short listenPort);

/******************************************************************************
 * 函数：acceptConnect
 * 参数：listenFd--监听fd；addr--返回连接地址
 * 功能：接收连接请求，并返回连接地址
 * 返回值：-1--失败；其他--客户端fd
 *****************************************************************************/
int acceptConnect(int listenFd, struct sockaddr_in *addr);

/******************************************************************************
 * 函数：connectToHost
 * 参数：fd--通信fd；ip--服务端ip；port--服务端端口
 * 功能：向服务端发起连接请求
 * 返回值：-1--失败；0--成功
 *****************************************************************************/
int connectToHost(int fd, const char *ip, unsigned short port);

/******************************************************************************
 * 函数：closeSocket
 * 参数：fd--要关闭的fd
 * 功能：关闭fd
 * 返回值：-1--失败；0--成功
 *****************************************************************************/
int closeSocket(int fd);

/******************************************************************************
 * 函数：readn
 * 参数：fd--对方fd；message--发送的信息；size--信息大小
 * 功能：接收指定长度的数据
 * 返回值：-1--失败；其他--已接收的字节数
 *****************************************************************************/
int readn(int fd, char *message, int size);

/******************************************************************************
 * 函数：recvMessage
 * 参数：fd--对方fd；message--接收的信息
 * 功能：接收来自fd的信息，并存放在message中
 * 返回值：-1--失败；0--断开连接；其他--接收的字节数
 *****************************************************************************/
int recvMessage(int fd, char **message);

/******************************************************************************
 * 函数：writen
 * 参数：fd--对方fd；message--发送的信息；size--信息大小
 * 功能：发送指定长度的数据
 * 返回值：-1--失败；其他--已发送的字节数
 *****************************************************************************/
int writen(int fd, const char *message, int size);

/******************************************************************************
 * 函数：sendMessage
 * 参数：fd--对方fd；message--发送的信息；len--信息大小
 * 功能：向fd发送信息
 * 返回值：-1--失败；0--断开连接；其他--发送的字节数
 *****************************************************************************/
int sendMessage(int fd, char *message, int len);
#endif